name: "UMDFace_SSD_512x512_train"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 512
  dim: 512
}

#layer {
#  name: "data"
#  type: "Input"
#  top: "data"
#  input_shape {
#    shape: {
#      dim: 1
#      dim: 3
#      dim: 512
#      dim: 512
#    }
#  }
#}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_1"
  top: "pool1"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_1"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_2"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_2"
  top: "pool4"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_2"
  top: "pool5"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv6_1"
  type: "Convolution"
  bottom: "pool5"
  top: "conv6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_1"
  type: "ReLU"
  bottom: "conv6_1"
  top: "conv6_1"
}
layer {
  name: "conv6_2"
  type: "Convolution"
  bottom: "conv6_1"
  top: "conv6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_2"
  type: "ReLU"
  bottom: "conv6_2"
  top: "conv6_2"
}
layer {
  name: "conv7_1"
  type: "Convolution"
  bottom: "conv6_2"
  top: "conv7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_1"
  type: "ReLU"
  bottom: "conv7_1"
  top: "conv7_1"
}
layer {
  name: "conv7_2"
  type: "Convolution"
  bottom: "conv7_1"
  top: "conv7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_2"
  type: "ReLU"
  bottom: "conv7_2"
  top: "conv7_2"
}
layer {
  name: "conv8_1"
  type: "Convolution"
  bottom: "conv7_2"
  top: "conv8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu8_1"
  type: "ReLU"
  bottom: "conv8_1"
  top: "conv8_1"
}
layer {
  name: "conv8_2"
  type: "Convolution"
  bottom: "conv8_1"
  top: "conv8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu8_2"
  type: "ReLU"
  bottom: "conv8_2"
  top: "conv8_2"
}
layer {
  name: "conv9_1"
  type: "Convolution"
  bottom: "conv8_2"
  top: "conv9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu9_1"
  type: "ReLU"
  bottom: "conv9_1"
  top: "conv9_1"
}
layer {
  name: "pool9"
  type: "Pooling"
  bottom: "conv9_1"
  top: "pool9"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
#################################################
layer {
  name: "conv5_2_mbox_loc"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_2_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 12
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv5_2_mbox_loc_perm"
  type: "Permute"
  bottom: "conv5_2_mbox_loc"
  top: "conv5_2_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv5_2_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv5_2_mbox_loc_perm"
  top: "conv5_2_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv5_2_mbox_conf"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_2_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 6
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv5_2_mbox_conf_perm"
  type: "Permute"
  bottom: "conv5_2_mbox_conf"
  top: "conv5_2_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv5_2_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv5_2_mbox_conf_perm"
  top: "conv5_2_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv5_2_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv5_2"
  bottom: "data"
  top: "conv5_2_mbox_priorbox"
  prior_box_param {
    min_size: 36.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "conv6_1_mbox_loc"
  type: "Convolution"
  bottom: "conv6_1"
  top: "conv6_1_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv6_1_mbox_loc_perm"
  type: "Permute"
  bottom: "conv6_1_mbox_loc"
  top: "conv6_1_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv6_1_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv6_1_mbox_loc_perm"
  top: "conv6_1_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv6_1_mbox_conf"
  type: "Convolution"
  bottom: "conv6_1"
  top: "conv6_1_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv6_1_mbox_conf_perm"
  type: "Permute"
  bottom: "conv6_1_mbox_conf"
  top: "conv6_1_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv6_1_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv6_1_mbox_conf_perm"
  top: "conv6_1_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv6_1_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv6_1"
  bottom: "data"
  top: "conv6_1_mbox_priorbox"
  prior_box_param {
    min_size: 72.0
    max_size: 172.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "conv7_1_mbox_loc"
  type: "Convolution"
  bottom: "conv7_1"
  top: "conv7_1_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv7_1_mbox_loc_perm"
  type: "Permute"
  bottom: "conv7_1_mbox_loc"
  top: "conv7_1_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv7_1_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv7_1_mbox_loc_perm"
  top: "conv7_1_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv7_1_mbox_conf"
  type: "Convolution"
  bottom: "conv7_1"
  top: "conv7_1_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv7_1_mbox_conf_perm"
  type: "Permute"
  bottom: "conv7_1_mbox_conf"
  top: "conv7_1_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv7_1_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv7_1_mbox_conf_perm"
  top: "conv7_1_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv7_1_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv7_1"
  bottom: "data"
  top: "conv7_1_mbox_priorbox"
  prior_box_param {
    min_size: 172.0
    max_size: 272.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "conv8_1_mbox_loc"
  type: "Convolution"
  bottom: "conv8_1"
  top: "conv8_1_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv8_1_mbox_loc_perm"
  type: "Permute"
  bottom: "conv8_1_mbox_loc"
  top: "conv8_1_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv8_1_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv8_1_mbox_loc_perm"
  top: "conv8_1_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv8_1_mbox_conf"
  type: "Convolution"
  bottom: "conv8_1"
  top: "conv8_1_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv8_1_mbox_conf_perm"
  type: "Permute"
  bottom: "conv8_1_mbox_conf"
  top: "conv8_1_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv8_1_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv8_1_mbox_conf_perm"
  top: "conv8_1_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv8_1_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv8_1"
  bottom: "data"
  top: "conv8_1_mbox_priorbox"
  prior_box_param {
    min_size: 272.0
    max_size: 372.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "conv9_1_mbox_loc"
  type: "Convolution"
  bottom: "conv9_1"
  top: "conv9_1_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv9_1_mbox_loc_perm"
  type: "Permute"
  bottom: "conv9_1_mbox_loc"
  top: "conv9_1_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv9_1_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv9_1_mbox_loc_perm"
  top: "conv9_1_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv9_1_mbox_conf"
  type: "Convolution"
  bottom: "conv9_1"
  top: "conv9_1_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv9_1_mbox_conf_perm"
  type: "Permute"
  bottom: "conv9_1_mbox_conf"
  top: "conv9_1_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv9_1_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv9_1_mbox_conf_perm"
  top: "conv9_1_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv9_1_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv9_1"
  bottom: "data"
  top: "conv9_1_mbox_priorbox"
  prior_box_param {
    min_size: 372.0
    max_size: 472.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "pool9_mbox_loc"
  type: "Convolution"
  bottom: "pool9"
  top: "pool9_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool9_mbox_loc_perm"
  type: "Permute"
  bottom: "pool9_mbox_loc"
  top: "pool9_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "pool9_mbox_loc_flat"
  type: "Flatten"
  bottom: "pool9_mbox_loc_perm"
  top: "pool9_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "pool9_mbox_conf"
  type: "Convolution"
  bottom: "pool9"
  top: "pool9_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool9_mbox_conf_perm"
  type: "Permute"
  bottom: "pool9_mbox_conf"
  top: "pool9_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "pool9_mbox_conf_flat"
  type: "Flatten"
  bottom: "pool9_mbox_conf_perm"
  top: "pool9_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "pool9_mbox_priorbox"
  type: "PriorBox"
  bottom: "pool9"
  bottom: "data"
  top: "pool9_mbox_priorbox"
  prior_box_param {
    min_size: 472.0
    max_size: 572.0
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
  }
}
#################################################
layer {
  name: "mbox_loc"
  type: "Concat"
  bottom: "conv5_2_mbox_loc_flat"
  bottom: "conv6_1_mbox_loc_flat"
  bottom: "conv7_1_mbox_loc_flat"
  bottom: "conv8_1_mbox_loc_flat"
  bottom: "conv9_1_mbox_loc_flat"
  bottom: "pool9_mbox_loc_flat"
  top: "mbox_loc"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mbox_conf"
  type: "Concat"
  bottom: "conv5_2_mbox_conf_flat"
  bottom: "conv6_1_mbox_conf_flat"
  bottom: "conv7_1_mbox_conf_flat"
  bottom: "conv8_1_mbox_conf_flat"
  bottom: "conv9_1_mbox_conf_flat"
  bottom: "pool9_mbox_conf_flat"
  top: "mbox_conf"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mbox_priorbox"
  type: "Concat"
  bottom: "conv5_2_mbox_priorbox"
  bottom: "conv6_1_mbox_priorbox"
  bottom: "conv7_1_mbox_priorbox"
  bottom: "conv8_1_mbox_priorbox"
  bottom: "conv9_1_mbox_priorbox"
  bottom: "pool9_mbox_priorbox"
  top: "mbox_priorbox"
  concat_param {
    axis: 2
  }
}
layer {
  name: "mbox_loss"
  type: "MultiBoxLoss"
  bottom: "mbox_loc"
  bottom: "mbox_conf"
  bottom: "mbox_priorbox"
  bottom: "label"
  top: "mbox_loss"
  include {
    phase: TRAIN
  }
  propagate_down: true
  propagate_down: true
  propagate_down: false
  propagate_down: false
  loss_param {
    normalization: VALID
  }
  multibox_loss_param {
    loc_loss_type: SMOOTH_L1
    conf_loss_type: SOFTMAX
    loc_weight: 1.0
    num_classes: 2
    share_location: true
    match_type: PER_PREDICTION
    overlap_threshold: 0.5
    use_prior_for_matching: true
    background_label_id: 0
    use_difficult_gt: true
    do_neg_mining: true
    neg_pos_ratio: 3.0
    neg_overlap: 0.5
    code_type: CENTER_SIZE
  }
}
layer {
  name: "mbox_conf_reshape"
  type: "Reshape"
  bottom: "mbox_conf"
  top: "mbox_conf_reshape"
  include {
    phase: TEST
  }
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 2
    }
  }
}
layer {
  name: "mbox_conf_softmax"
  type: "Softmax"
  bottom: "mbox_conf_reshape"
  top: "mbox_conf_softmax"
  include {
    phase: TEST
  }
  softmax_param {
    axis: 2
  }
}
layer {
  name: "mbox_conf_flatten"
  type: "Flatten"
  bottom: "mbox_conf_softmax"
  top: "mbox_conf_flatten"
  include {
    phase: TEST
  }
  flatten_param {
    axis: 1
  }
}
layer {
  name: "detection_out"
  type: "DetectionOutput"
  bottom: "mbox_loc"
  bottom: "mbox_conf_flatten"
  bottom: "mbox_priorbox"
  top: "detection_out"
  include {
    phase: TEST
  }
  detection_output_param {
    num_classes: 2
    share_location: true
    background_label_id: 0
    nms_param {
      nms_threshold: 0.45
      top_k: 400
    }
#    save_output_param {
#      output_directory: "/data/kc-nfs/face_detection_ssd/output"
#      output_name_prefix: "comp4_det_test_"
#      output_format: "VOC"
#      label_map_file: "/data/kongchang/UMDFace/umdface_ssd_format/LMDB/labelmap_face.prototxt"
#      name_size_file: "/data/kongchang/UMDFace/umdface_ssd_format/LMDB/test_name_size.txt"
#      num_test_image: 5000
#    }
    code_type: CENTER_SIZE
    keep_top_k: 200
    confidence_threshold: 0.01
  }
}

